In [1]:
pip install cx_Oracle

Requirement already satisfied: cx_Oracle in c:\programdata\anaconda3\envs\kita\lib\site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

In [13]:
import cx_Oracle
import pandas as pd
con = cx_Oracle.connect("c##hr", "hr", "localhost:1521/xe")
cur = con.cursor()
cur.execute('select * from employees')
res = cur.fetchall()
df = pd.DataFrame(res)
cur.execute("select column_name from user_tab_columns where table_name='EMPLOYEES'")
col = cur.fetchall()
col
li = []
for i in col:
    for j in i:
        li.append(j)
df.columns = li
print(df.head())
cur.close()
con.close()

   EMPLOYEE_ID FIRST_NAME  LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE  \
0          198     Donald   OConnell  DOCONNEL  650.507.9833 2007-06-21
1          199    Douglas      Grant    DGRANT  650.507.9844 2008-01-13
2          200   Jennifer     Whalen   JWHALEN  515.123.4444 2003-09-17
3          201    Michael  Hartstein  MHARTSTE  515.123.5555 2004-02-17
4          202        Pat        Fay      PFAY  603.123.6666 2005-08-17

     JOB_ID   SALARY  COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
0  SH_CLERK   2600.0             NaN       124.0             50
1  SH_CLERK   2600.0             NaN       124.0             50
2   AD_ASST   4400.0             NaN       101.0             10
3    MK_MAN  13000.0             NaN       100.0             20
4    MK_REP   6000.0             NaN       201.0             20

과제1_1127. employee 테이블에서 탐색적 분석을 통하여 3가지 인사이트를 찾아서 설명하세요.

In [11]:
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600.0,NaN,124.0,50
1,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600.0,NaN,124.0,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400.0,NaN,101.0,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000.0,NaN,100.0,20
4,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20